## Final Project Submission

Please fill out:
* Student name: 
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

Importing all the tools

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import json

In [3]:
pwd

'C:\\Users\\murra\\Documents\\Flatiron_classwork\\phase_1\\dsc-phase-1-project-online'

In [49]:
ratings_df = pd.read_csv(r"C:\Users\murra\Documents\Flatiron_classwork\phase_1\dsc-phase-1-project-online\zippedData\imdb.title.ratings.csv.gz")
title_basics_df = pd.read_csv(r"C:\Users\murra\Documents\Flatiron_classwork\phase_1\dsc-phase-1-project-online\zippedData\imdb.title.basics.csv.gz")
gross_income_df = pd.read_csv(r"C:\Users\murra\Documents\Flatiron_classwork\phase_1\dsc-phase-1-project-online\zippedData\bom.movie_gross.csv.gz")
budgets_df = pd.read_csv(r"C:\Users\murra\Documents\Flatiron_classwork\phase_1\dsc-phase-1-project-online\zippedData\tn.movie_budgets.csv.gz")
name_basics_df = pd.read_csv(r"C:\Users\murra\Documents\Flatiron_classwork\phase_1\dsc-phase-1-project-online\zippedData\imdb.name.basics.csv.gz")
movie_info_df = pd.read_csv(r"C:\Users\murra\Documents\Flatiron_classwork\phase_1\dsc-phase-1-project-online\zippedData\rt.movie_info.tsv.gz", sep='\t')
title_crew_df = pd.read_csv(r"C:\Users\murra\Documents\Flatiron_classwork\phase_1\dsc-phase-1-project-online\zippedData\imdb.title.crew.csv.gz")
title_principals_df = pd.read_csv(r"C:\Users\murra\Documents\Flatiron_classwork\phase_1\dsc-phase-1-project-online\zippedData\imdb.title.principals.csv.gz")

In [50]:
title_principals_df.head()

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

In [52]:
print(len(title_crew_df))

title_crew_df.head()

146144

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [51]:
print(len(movie_info_df))
movie_info_df.head()

1560

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [41]:
name_basics_df.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [31]:
print(len(ratings_df))
ratings_df.head()

73856

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [30]:
print(len(title_basics_df))
title_basics_df.head()

146144

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [33]:
ratings_basics = pd.merge(ratings_df, title_basics_df)

In [34]:
ratings_basics.head()

,tconst,averagerating,numvotes,primary_title,original_title,start_year,runtime_minutes,genres
0,tt10356526,8.3,31,Laiye Je Yaarian,Laiye Je Yaarian,2019,117.0,Romance
1,tt10384606,8.9,559,Borderless,Borderless,2019,87.0,Documentary
2,tt1042974,6.4,20,Just Inès,Just Inès,2010,90.0,Drama
3,tt1043726,4.2,50352,The Legend of Hercules,The Legend of Hercules,2014,99.0,"Action,Adventure,Fantasy"
4,tt1060240,6.5,21,Até Onde?,Até Onde?,2011,73.0,"Mystery,Thriller"

In [53]:
basics_ratings_directors_df = pd.merge(ratings_basics, title_crew_df)
basics_ratings_directors_df.head()

,tconst,averagerating,numvotes,primary_title,original_title,start_year,runtime_minutes,genres,directors,writers
0,tt10356526,8.3,31,Laiye Je Yaarian,Laiye Je Yaarian,2019,117.0,Romance,nm8353804,"nm3057599,nm4179342"
1,tt10384606,8.9,559,Borderless,Borderless,2019,87.0,Documentary,"nm9932562,nm9250842",NaN
2,tt1042974,6.4,20,Just Inès,Just Inès,2010,90.0,Drama,nm1915232,nm1915232
3,tt1043726,4.2,50352,The Legend of Hercules,The Legend of Hercules,2014,99.0,"Action,Adventure,Fantasy",nm0001317,"nm0393517,nm0316417,nm0001317,nm1048866"
4,tt1060240,6.5,21,Até Onde?,Até Onde?,2011,73.0,"Mystery,Thriller",nm1926349,nm1926349

In [39]:
ratings_basics.isnull().sum(axis = 0)

tconst                0
averagerating         0
numvotes              0
primary_title         0
original_title        0
start_year            0
runtime_minutes    7620
genres              804
dtype: int64

In [37]:
ratings_basics[ratings_basics['primary_title'].str.contains('Avengers')]

,tconst,averagerating,numvotes,primary_title,original_title,start_year,runtime_minutes,genres
31756,tt6172666,2.4,190,Avengers of Justice: Farce Wars,Avengers of Justice: Farce Wars,2018,87.0,"Action,Comedy,Family"
48221,tt0848228,8.1,1183655,The Avengers,The Avengers,2012,143.0,"Action,Adventure,Sci-Fi"
59785,tt4154796,8.8,441135,Avengers: Endgame,Avengers: Endgame,2019,181.0,"Action,Adventure,Sci-Fi"
65058,tt10075836,7.2,18,The Avengers Assemble Premiere,The Avengers Assemble Premiere,2012,NaN,Action
66768,tt2395427,7.3,665594,Avengers: Age of Ultron,Avengers: Age of Ultron,2015,141.0,"Action,Adventure,Sci-Fi"
71879,tt4154756,8.5,670926,Avengers: Infinity War,Avengers: Infinity War,2018,149.0,"Action,Adventure,Sci-Fi"

In [27]:
print(len(gross_income_df))
gross_income_df.head()

3387

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [28]:
print(len(budgets_df))
budgets_df.head()

5782

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [29]:

budgets_df[budgets_df['movie'].str.contains('Avengers')]

5782

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
6,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200"
26,27,"May 4, 2012",The Avengers,"$225,000,000","$623,279,547","$1,517,935,897"
934,35,"Aug 14, 1998",The Avengers,"$60,000,000","$23,385,416","$48,585,416"

In [26]:
gross_income_df[gross_income_df['title'].str.contains('Avengers')]

                        title studio  domestic_gross foreign_gross  year
727     Marvel's The Avengers     BV     623400000.0     895500000  2012
1875  Avengers: Age of Ultron     BV     459000000.0     946400000  2015
3079   Avengers: Infinity War     BV     678800000.0       1,369.5  2018